packages/archaea-simulation/archaea_simulation-1.0.17.tar.gz/archaea_simulation-1.0.17/archaea_simulation/cfd/case/system/cutPlaneSurface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out cut-plane surface files with interpolated field data in VTK
    format.

\*---------------------------------------------------------------------------*/

point       (0 0 1.5);
normal      (0 0 1);

fields      (U);

interpolate false; // If false, write cell data to the surface triangles.
                  // If true, write interpolated data at the surface points.

#includeEtc "caseDicts/postProcessing/surface/cutPlaneSurface.cfg"

// ************************************************************************* //
